app/views/welcome/index.html.erb

			<div id="bloque_2_1" class="bloque_2">
 				<% unless User.find_by(id: session[:user_id]) %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1