app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'admin' LIMIT 1
SELECT  "rols".* FROM "rols"  WHERE "rols"."id" = 1 LIMIT 1
---
  def create
  	user = User.find_by(username: params[:username])
  	if user and user.authenticate(params[:password])
  		session[:user_id] = user.id
  		session[:uname] = user.name + " " + user.lastname
  		session[:rol_id] = user.rol_id
      puts "dentro del if"
      puts "hola" + user.name + " " + user.lastname

      #variables de rol
      rol =Rol.find_by(id: user.rol_id)

SELECT  "rols".* FROM "rols"  WHERE "rols"."id" = ? LIMIT 1  [["id", 1]]
---
  def pagos
    @rol = Rol.find(session[:rol_id])